a = [
[3, 23, 85, 34, 17, 74, 25, 52, 65], [10, 7, 39, 42, 88, 52, 14, 72, 63],
[87, 42, 18, 78, 53, 45, 18, 84, 53], [34, 28, 64, 85, 12, 16, 75, 36, 55],
[21, 77, 45, 35, 28, 75, 90, 76, 1], [25, 87, 65, 15, 28, 11, 37, 28, 74],
[65, 27, 75, 41, 7, 89, 78, 64, 39], [47, 47, 70, 45, 23, 65, 3, 41, 44],
[87, 13, 82, 38, 31, 12, 29, 29, 80]
]

b = []

for i in range(0,len(a)):
    x = a[i]
    z = 0
    for y in range(0,len(x)):
        z = z + x[y]
    b.append(z)

c = b.copy()
c.sort()
c.reverse()

print(b)
print(c)

for i in range(0,len(b)):
    if c[0] == b[i]:
        print(f"열의 합이 가장 큰 열은 {i+1}열 입니다.")
        print(f"{i+1}열{a[i]}의 합은 {b[i]}입니다.")

b_max = max(b)


for i in range(0,len(b)):
    if b_max == b[i]:
        print(f"열의 합이 가장 큰 열은 {i+1}열 입니다.")
        print(f"{i+1}열{a[i]}의 합은 {b[i]}입니다.")