Q.01
# 문자열 변환 .
# zero = 0 one = 1 two = 2 three = 3 four = 4 ... nine = 9
# 0 ~ 9
# one4seveneight -> 1478
# 2three45sixseven -> 234567
# 23four5six7 -> 234567
# def solution(st: str):
#     return int
Q.02
# 페이지 숫자 세기.
# 19페이지
# 1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
# 1이 몇번 나오는지 9가 몇번 나오는지 
# 1은 12번, 9는 2번
# def solution(n:int)
#     return print()
Q.03
# 배열 움직이기
# [1, 2, 3, 4, 5, 6]
# ["left","right","right","right"]
# "left"[2,3,4,5,1]
# "right"[1,2,3,4,5,6]
# "right"[6,1,2,3,4,5]
# "right"[5,6,1,2,3,4]
# def solution(numbers:list[int], direction:str):
#     answer = []
#     return answer
Q.04
# 뒤집어 더하기 빼기
# 뒤집기 전 짝수일때 빼기 
# [123,234,543]
# 321 - 432 + 345 = 234
# [77,977,5654]
# 77 + 779 - 4565 = -3709
# def solution(numbers:list):
#     answer = []
#     return answer
Q.05
# 각행 소수 개수
# key 각 행의 번호
# value 소수의 개수
# c =[
# [3, 23, 85, 34, 17, 74, 25, 52, 65],[10, 7, 39, 42, 88, 52, 14, 72, 63],[87, 42, 18, 78, 53, 45, 18, 84, 53],
# [34, 28, 64, 85, 12, 16, 75, 36, 55],[21, 77, 45, 35, 28, 75, 90, 76, 1],[25, 87, 65, 15, 28, 11, 37, 28, 74],
# [65, 27, 75, 41, 7, 89, 78, 64, 39],[47, 47, 70, 45, 23, 65, 3, 41, 44],[87, 13, 82, 38, 31, 12, 29, 29, 80]
# ]
Q.06
# 내가 43250원이 있다.
# 만원짜리는 몇장이고
# 오천원짜리는 몇장이고
# 천원짜리는 몇장이고
# 500원짜리는 몇개이고
# 100원짜리는 몇개이고
# 50원짜리는 몇개이고
# 10원짜리는 몇개있다.